### Practice 0720

#### Grouping Rows by Time

In [1]:
import pandas as pd
import numpy as np
# Create date range
time_index = pd.date_range('06/06/2017', periods=100000, freq='30S')

In [2]:
df=pd.DataFrame(index=time_index)

In [3]:
df['Sale Amount'] = np.random.randint(1, 10, 100000)

In [4]:
# group rows by week, aggregate by sum (resample)
df.resample('W').sum()

            Sale Amount
2017-06-11        86131
2017-06-18       101177
2017-06-25        99924
2017-07-02       100622
2017-07-09       100459
2017-07-16        10470

In [5]:
df.head(3)

                     Sale Amount
2017-06-06 00:00:00            1
2017-06-06 00:00:30            3
2017-06-06 00:01:00            4

In [6]:
df.resample('2W').mean()

            Sale Amount
2017-06-11     4.984433
2017-06-25     4.987624
2017-07-09     4.987128
2017-07-23     5.033654

In [7]:
df.resample('M').count()

            Sale Amount
2017-06-30        72000
2017-07-31        28000

In [8]:
# default resample returns the 'right' edge of the range, can change
# this with the 'label' parameter:
df.resample('M', label='left').count()

            Sale Amount
2017-05-31        72000
2017-06-30        28000

            Sale Amount
2017-06-11     4.984433
2017-06-25     4.987624
2017-07-09     4.987128
2017-07-23     5.033654

#### Looping Over a Column

In [12]:
# return to titanic db
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

df = pd.read_csv(url)

# print first two names uppercased

for name in df['Name'][0:2]:
    print(name.upper())

ALLEN, MISS ELISABETH WALTON
ALLISON, MISS HELEN LORAINE